АТДЛК/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <registerRecords>AccumulationRegister.Прибыль</registerRecords>
  <attributes>
    <name>ЗаявкаКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ЗаявкаНаПеревозку</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяТочка</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяТочка</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ПеречислениеСтатусЗаявки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АТДЛК/src/AccumulationRegisters/Прибыль/Прибыль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Прибыль</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АТДЛК/src/Documents/МаршрутныйЛист/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Прибыль
	Движения.Прибыль.Записывать = Истина;
	Для Каждого ТекСтрокаМаршрут из Маршрут Цикл
		Движение = Движения.Прибыль.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Заявка = ЗаявкаКлиента;
		Движение.Сумма = ТекСтрокаМаршрут.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщаяСтоимость =  Маршрут.Итог("Сумма")
КонецПроцедуры
